//////////////////////////////////////////////////////////
// This class has been automatically generated on
// Mon Jun  8 08:26:41 2009 by ROOT version 5.18/00a
// from TTree allData/data after cuts
// found on file: lm1_NT3.root
//////////////////////////////////////////////////////////

#ifndef allData2_h
#define allData2_h

#include <TROOT.h>
#include <TChain.h>
#include <TFile.h>
#include <stdio.h>
#include <stdlib.h>
#include <iostream>
#include <string>
#include <vector>
#include "TLorentzVector.h"

class allData2 {
  public :
    TTree          *fChain;   //!pointer to the analyzed TTree or TChain
  Int_t           fCurrent; //!current Tree number in a TChain

  // Declaration of leaf types
  UInt_t          run;
  UInt_t          event;

  Int_t           nHLT;
  Int_t           HLTArray[159];
  UChar_t         HLT1JET;
  UChar_t         HLT2JET;
  UChar_t         HLT1MET1HT;
  UChar_t         HLT1MUON;


  UInt_t          genN;
  UInt_t          genid[50];//1000
  UInt_t          genMother[50];//1000
  Float_t         genE[50];//1000
  Float_t         genPx[50];//1000
  Float_t         genPy[50];//1000
  Float_t         genPz[50];//1000
  UInt_t          genStatus[50];//1000

  UInt_t          genLepN;
  UInt_t          genLepId[50];//100
  UInt_t          genLepMother[50];//100
  Float_t         genLepE[50];//100
  Float_t         genLepPx[50];//100
  Float_t         genLepPy[50];//100
  Float_t         genLepPz[50];//100
  UInt_t          genLepStatus[50];//100


  UInt_t          nVtx;
  Double_t        VtxChi2[5];
  Double_t        VtxNdof[5];
  Double_t        VtxNormalizedChi2[5];
  Double_t        VtxX[5];
  Double_t        VtxY[5];
  Double_t        VtxZ[5];
  Double_t        VtxdX[5]; 
  Double_t        VtxdY[5]; 
  Double_t        VtxdZ[5];

  UInt_t          nFullMET;
  Double_t        MET_fullcorr_nocc[3];
  Double_t        MET_fullcorr_cc[3];
  Double_t        METphi_fullcorr_nocc;
  UInt_t          nUncorrMET;
  Double_t        MET_nocorr_nocc[2];
  //Double_t        METphi_nocorr_nocc;
  Double_t        MET_jeccorr_nocc[2];
  Double_t        METphi_jeccorr_nocc;
  Double_t        MET_muoncorr_nocc[2];
  Double_t        METphi_muoncorr_nocc;
  Double_t        MET_Fullcorr_nocc_significance;
  Double_t        GenMET[3];

  Double_t        evtWeight;
  UInt_t          procID;
  Double_t        pthat;


  UInt_t          Nhemispheres;
